/************************************************
 * マクロ部
 ************************************************/
#include <stdio.h>

/************************************************
 * グローバル変数
 ************************************************/

/************************************************
 * 構造体等宣言部
 ************************************************/
struct point { int x, y; };	//座標

/************************************************
 * プロトタイプ宣言部
 ************************************************/

/************************************************
 * 関数部
 ************************************************/
///
/// 配列aに対してバケツソートを実行
///
void bucket_sort(struct point a[], int n) {
	int c[100] = {};
	struct point p, b[n];
	for(int i = 0; i < n; i++) {
		int num_x = a[i].x;
		c[num_x] += 1;
		b[i] = a[i];
	}
	for(int i = 1; i < 100; i++) {
		c[i] += c[i-1];
	}
	for(int i = n-1; i >= 0; i--) {
		p = b[i];
		c[p.x] -= 1;
		a[c[p.x]] = p;
	}
}

///
/// メイン関数
///
int main() {
	char buf[128];
	struct point p, arr[128];
	int i = 0, n;
	while(fgets(buf,sizeof(buf),stdin) != NULL && i<128) {
		sscanf(buf, "%d %d", &p.x, &p.y);
		arr[i] = p;
		++i;
	}
	n = i;
	bucket_sort(arr, n);
	for(i=0; i<n; ++i)
		printf("%d %d\n", arr[i].x, arr[i].y);
	return 0;
}