/************************************************
 * マクロ部
 ************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdbool.h>

/************************************************
 * プロトタイプ宣言部
 ************************************************/

/************************************************
 * グローバル変数
 ************************************************/

/************************************************
 * 関数部
 ************************************************/
int main(void) {
    char buf[128];    // 入力保存用
    // 入力
    fgets(buf, 128, stdin);
    // 文字列の長さを取得
    int buf_len = strlen(buf);

    // '//'の位置の探索
    char *p = strstr(buf, "//");
    int p_len = 0;  // '//'以降の長さ
    // '//'が存在するなら
    if(p != NULL) {
        p_len = strlen(p);  // '//'以降の長さを取得
        p_len -= 1; // 改行文字分調整
    }

    printf("%d", buf_len - p_len - 1);  // 改行文字の数'1'を引いている

    return 0;
}
