/************************************************
 * マクロ部
 ************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>

#define BUFMAX 256

/************************************************
 * プロトタイプ宣言部
 ************************************************/

/************************************************
 * グローバル変数
 ************************************************/

/************************************************
 * 関数部
 ************************************************/
int main(void) {
    char w1[BUFMAX + 2];    // 入力保存用
    char w2[BUFMAX + 2];    // 入力保存用
    // 入力
    fgets(w1, 258, stdin); fgets(w2, 258, stdin);

    // 探索
    bool flag = true;   // 探索の成否
    int place = -1;  // 位置の保存
    for(int i = 0; w1[i] != '\n'; i++) {    // w2の最初の文字とw1の全ての文字を比較
        flag = true;
        if(w1[i] == w2[0]) {
            for(int j = 1; w2[j] != '\n'; j++) {    //w2の以降の文字と一致するか
                if(w1[i+j] != w2[j]) {
                    flag = false;
                    break;
                }
            }
            if(flag) {
                place = i;  // 探索成功時場所保存
                break;
            }
        }
    }

    printf("%d", place);    // 表示
    return 0;
}
