/************************************************
 * マクロ部
 ************************************************/
#include <stdio.h>

#define SETMAX 10600	// 集合の要素数の最大値(駅の数)

/************************************************
 * グローバル変数
 ************************************************/

/************************************************
 * 構造体等宣言部
 ************************************************/
struct set { int elements[SETMAX]; int size; };

/************************************************
 * プロトタイプ宣言部
 ************************************************/

/************************************************
 * 関数部
 ************************************************/
///
/// eを除く0からn-1までの整数を要素とする集合を、
/// アドレスpの指す構造体に格納する関数
///
void init_set(struct set *p, int n, int e) {
	int i, count = 0;
	for(i = 0; i < n; i++) {
		if(i != e) {
			p->elements[count++] = i;
		}
	}
	p->size = n-1;
}

///
/// 構造体の要素を出力する関数
///
void print_set(struct set *p) {
	int i;
	printf("{");
	for(i = 0; i < p->size; ++i) printf(" %d", p->elements[i]);
	printf(" }\n");
}

///
/// メイン関数
///
int main() {
	int n, e;
	struct set s;	//集合 s を用意
	scanf("%d %d ", &n, &e);	//入力から n と e を読み込み
	init_set(&s, n, e);	// s のアドレスと n と e を渡す
	print_set(&s);
	return 0;
}