/************************************************
 * マクロ部
 ************************************************/

#include <stdio.h>

/************************************************
 * グローバル変数
 ************************************************/

char kijun;	//大小比較の規準を表す

/************************************************
 * 構造体等宣言部
 ************************************************/

struct point { int x, y; };


/************************************************
 * プロトタイプ宣言部
 ************************************************/

/************************************************
 * 関数部
 ************************************************/
///
///
///
int compare(struct point p1, struct point p2) {

}

///
///
///
int partition(struct point a[], int m, int n) {

}

///
/// メイン関数
///
int main() {
	char buf[128];
	struct point p, arr[128];
	int i = 0, n;
	scanf("%c ", &kijun);	//規準の読み込み
	while(fgets(buf, sizeof(buf), stdin) != NULL && i < 128) {
		sscanf(buf, "%d %d", &p.x, &p.y);
		arr[i] = p;
		++i;
	}
	n = i;
	printf("%d\n", partition(arr, 0, n-1));
	for(i = 0; i < n; ++i)
		printf("%d %d\n", arr[i].x, arr[i].y);
	return 0;
}